  Лабораторная работа N 8

  Решение системы дифференциальных уравнений
             методом Рунге-Кутта            

Выполнила студентка 4 курса группы КАТМА Мукасеева Дарья

Начальный шаг    0.2

Решение системы дифференциальных уравнений
  методом Рунге-Кутта четвертого порядка   

x = 0  y1= 0.7  y2= -0.5

x = 0.1  y1= 0.791006434669597  y2= -0.449858883685511

x = 0.2  y1= 0.887205785080813  y2= -0.395642106648619

x = 0.3  y1= 0.986419053900026  y2= -0.33778720004625

x = 0.4  y1= 1.08622073320695  y2= -0.276677914136083

x = 0.5  y1= 1.18401501805427  y2= -0.21265090807202

x = 0.6  y1= 1.27712309688281  y2= -0.146001796587362

x = 0.7  y1= 1.36287827509361  y2= -0.0769905156090266

x = 0.8  y1= 1.4387252338703  y2= -0.00584602616176391

x = 0.9  y1= 1.50231942810671  y2= 0.0672295945940407

x = 1  y1= 1.55162249856953  y2= 0.142057613586767

